Repository: navnit3366/pootle-python-org-backup-master
Catalog: pos/locale/python/*/bugs.po
Languages: pl, pt, zh

source: Reporting Bugs
pl: Zgłaszanie błędów
pt: Reportando erros
zh: 提交BUG

source: Python is a mature programming language which has established a reputation for stability. In order to maintain this reputation, the developers would like to know of any deficiencies you find in Python.
pl: Python jest dojrzałym językiem programowania, który posiada ugruntowaną reputację, jako język stabilny. Aby utrzymać tę reputację, jego twórcy chcieliby dowiedzieć się o jakichkolwiek jego błędach, na które zdarzyło Ci się natknąć.
pt: Python é uma linguagem de programação madura, que estabeleceu uma reputação por sua estabilidade. Para que seja mantida essa reputação, os desenvolvedores gostariam de saber sobre qualquer deficiência que você encontrar no Python.
zh: Python是一种成熟的编程语言，它以稳定著称。为了保持这种稳定性，开发者们乐意知道任何Python的不足之处。

source: Documentation bugs
pl: Błędy dokumentacji
pt: Erros na documentação
zh: 文档Bug

source: If you find a bug in this documentation or would like to propose an improvement, please send an e-mail to docs@python.org describing the bug and where you found it. If you have a suggestion how to fix it, include that as well.
pl: Jeśli znalazłeś błąd w tej dokumentacji lub masz pomysł, jak ją ulepszyć, wyślij maila na adres: docs@python.org z opisem błędu i tego jak się na niego natknąłeś. Jeśli masz sugestię jak go poprawić, załącz ją także.
pt: Se você encontrar um erro nesta documentação ou quiser propor uma melhoria, por favor mande um e-mail para docs@python.org descrevendo o erro e onde você o encontrou. Se você tiver uma sugestão de como concertá-lo, inclua isso também.
zh: 如果你发现了文档中的Bug或是你想要加以改进，请发送邮件到docs@python.org描述一下这个Bug和在哪里发现它的。如果你有修正它的办法，请在邮件中一并描述。

source: docs@python.org is a mailing list run by volunteers; your request will be noticed, even if it takes a while to be processed.
pl: docs@python.org jest listą dyskusyjną utrzymywaną przez społeczność. Twoja wiadomość zostanie zauważona, nawet jeśli nie uzyskasz natychmiastowej reakcji.
pt: docs@python.org é uma lista de e-mail administrada por voluntários; sua requisição será observada, mesmo que leve algum tempo para ser processada.
zh: docs@python.org是由志愿者们维护的邮件列表；您的请求将被注意到，即使它需要一段时间来进行处理。

source: Of course, if you want a more persistent record of your issue, you can use the issue tracker for documentation bugs as well.
pl: Oczywiście, jeśli wolał(a)byś bardziej utrwalone zgłoszenie twojego problemu, możesz również skorzystać z systemu zgłaszania błędów Pythona.
pt: Claro que, se você quiser um registro mais persistente de seu problema, você pode usar o "issue tracker" para erros de documentação também.
zh: 当然，如果你想要更长久的记录您的问题，您还可以使用文档Bug的问题追踪器(issue tracker)

source: Using the Python issue tracker
pl: Jak korzystać z systemu zgłaszania błędów Pythona
pt: Usando o "issue tracker" do Python
zh: 使用Python问题追踪器

source: Bug reports for Python itself should be submitted via the Python Bug Tracker (http://bugs.python.org/). The bug tracker offers a Web form which allows pertinent information to be entered and submitted to the developers.
pl: Raporty o błędach w języku python należy wysyłać przy pomocy systemu zgłaszania błędów języka python (http://bugs.python.org). System zgłoszeń oferuje formularz dla wprowadzania stosownych informacji i przekazywania ich twórcom języka.
pt: Relatórios de erros para o Python em si devem ser enviada através do Python "Bug Tracker" (http://bugs.python.org/). O "bug tracker" oferece um formulário Web que permite que as informações pertinentes sejam inscritas e submetidas para os desenvolvedores.
zh: Python的Bug应该通过Python问题追踪器(Python Bug Tracker)(http://bugs.python.org/)来提交。它提供了一个Web表格来填写相关信息并提交给开发者们。

source: The first step in filing a report is to determine whether the problem has already been reported. The advantage in doing so, aside from saving the developers time, is that you learn what has been done to fix it; it may be that the problem has already been fixed for the next release, or additional information is needed (in which case you are welcome to provide it if you can!). To do this, search the bug database using the search box on the top of the page.
pl: Pierwszym krokiem przy wypełnianiu zgłoszenia jest ustalenie, czy dany problem został już zgłoszony. Zaletą takiego postępowania, oprócz oszczędności czasu twórców języka, jest to, że dowiadujesz się, co uczyniono, aby naprawić dany błąd. Może tak być, że problem został naprawiony w następnej wersji, lub więcej informacji szczegółowych jest wymagane (w takim przypadku uprasza się o ich dostarczenie, jeśli masz taką możliwość!). Aby to zrobić, przejrzyj spis problemów używając pola wyszukiwania umieszczonego u góry strony.
pt: O primeiro passo na apresentação de um relatório é determinar se o problema já foi relatado. A vantagem em fazê-lo, além de poupar o tempo dos desenvolvedores, é que você saiba o que tem sido feito para corrigi-lo; pode ser que o problema já foi corrigido para o próximo "release" (lançamento), ou informações adicionais são necessárias (caso em que são bem-vindos para fornecê-las se puder!). Para fazer isso, procure o banco de erros usando a caixa de busca na parte superior da página.
zh: 填写报告的第一步是需要确定这问题是否已经提交过了。这样做的好处是，除了节省开发者的时间，你还知道了该问题是怎么解决的；它可能在下一个发行版中就解决了，也可能需要提供更多信息（在这种情况下，您如果可以的话欢迎提供！）。你可以通过使用页面顶部的搜索框来搜索Bug数据库来做这件事。

source: If the problem you're reporting is not already in the bug tracker, go back to the Python Bug Tracker and log in. If you don't already have a tracker account, select the "Register" link or, if you use OpenID, one of the OpenID provider logos in the sidebar. It is not possible to submit a bug report anonymously.
pl: Jeśli problem nie został jeszcze zgłoszony, powróć do zgłaszania błędu i zaloguj się. Jeśli nie masz jeszcze konta, wybierz link "zarejestruj się"; jeśli korzystasz z OpenID, kliknij na logo swojego providera. Nie jest możliwe zgłoszenie błędu anonimowo.
pt: Se o problema que está relatando já não está no "bug tracker", volte para o "Python Bug Tracker" e faça o login. Se você não tiver uma conta "tracker", selecione o link "Register" (Registrar) ou, se você usar o OpenID, um dos logos dos provedores OpenID na barra lateral. Não é possível submeter um relatório de erro anonimamente.
zh: 如果您报告的问题没有在问题追踪器里，返回Pythony Bug Tracker并登录。如果您还没有帐号，选择"Register"链接，或者您使用OpenID的话，选择边栏上的OpenID提供者标识。不可以使用匿名帐号提交问题报告的。

source: Being now logged in, you can submit a bug. Select the "Create New" link in the sidebar to open the bug reporting form.
pl: Będąc już zalogowanym, możesz zgłosić błąd. Kliknij w link "Stwórz nowy" znajdujący się na panelu bocznym, aby otworzyć formularz zgłaszania błędu.
pt: Uma vez identificado, você pode submeter um erro. Selecione o link "Create New" (Criar novo) na barra lateral para abrir o formulário de notificação de erros.
zh: 现在您登录上以后，就可以提交Bug了。选择边栏上的"Create New"链接来打开Bug提交的表单。

source: The submission form has a number of fields. For the "Title" field, enter a *very* short description of the problem; less than ten words is good. In the "Type" field, select the type of your problem; also select the "Component" and "Versions" to which the bug relates.
pl: Formularz zgłoszeniowy posiada wiele pól. Do pola "Tytuł" wpisz *dość* krótki opis problemu, najlepiej mniej niż dziesięć słów. W polu "Typ" wybierz typ problemu; wybierz również "Komponent" i "Wersje" do których odnosi się błąd.
pt: O formulário de submissão tem um número de campos. Para o campo "Title" (Título), digite uma descrição *muito* pequena do problema; menos de dez palavras está bom. No campo "Type" (Tipo), selecione o tipo do seu problema; também selecione o "Component" (Componente) e "Versions" (Versões) as que o erro se refere.
zh: 提交表格中有好些个栏目。在"Title"栏，输入*很*短的问题描述；最好在10个字以下。在"Type"栏，选择您的问题类型；也要选择问题相关的"Component"(组件)和"Versions"(版本）

source: In the "Comment" field, describe the problem in detail, including what you expected to happen and what did happen. Be sure to include whether any extension modules were involved, and what hardware and software platform you were using (including version information as appropriate).
pl: W polu "Komentarz", opisz problem szczegółowo, wskazując co miało nastąpić, a co nastąpiło. Pamiętaj, aby podać, czy jakiekolwiek moduły dodatkowe były stosowane i jakich platform sprzętowych i programowych używałeś (w tym informacji o wersji w stosownych przypadkach).
pt: No campo "Comment" (Comentário), descreva o problema em detalhes, incluindo o que você esperava que acontecesse e o que aconteceu. Certifique-se de incluir se algum módulo de extensão estava envolvido, e que plataforma de hardware e software você estava usando (incluindo informações sobre a versão conforme o caso).
zh: 在"Comment"(评论)栏，详细说明问题的细节，包括期望的结果和实际结果。请确保提供依赖的扩展模块和您所使用的软硬件平台信息（最好能有版本信息）。

source: Each bug report will be assigned to a developer who will determine what needs to be done to correct the problem. You will receive an update each time action is taken on the bug. See http://www.python.org/dev/workflow/ for a detailed description of the issue workflow.
pl: Każdy raport o błędzie zostanie przypisany do programisty, który zadecyduje o tym, co należy zrobić, aby rozwiązać problem. Otrzymasz powiadomienie za każdym razem gdy zostanie podjęte działanie w odpowiedzi na błąd. Zobacz http://www.python.org/dev/workflow/ aby uzyskać szczegółowy opis opracowania w tym temacie.
pt: Cada relatório de erro será atribuído ao colaborador que irá determinar o que precisa ser feito para corrigir o problema. Você vai receber uma atualização a cada ação tomada sobre o erro. Veja http://www.python.org/dev/workflow/ para uma descrição detalhada do fluxo de trabalho do caso.
zh: 每个错误报告将被分配给开发人员，他们将决定需要做什么来解决问题。每次对Bug采取的行动您都会收到更新。参考 http://www.python.org/dev/workflow/ 来得到详细的工作流程说明。

source: See also
pl: Zobacz też:
pt: Veja também
zh: 参考

source: Article which goes into some detail about how to create a useful bug report. This describes what kind of information is useful and why it is useful.
pl: Artykuł, który opowiada bardziej szczegółowo o tym jak stworzyć użyteczny raport o błędzie. Opisuje, jakiego rodzaju informacje są użyteczne i dlaczego.
pt: Artigo que entra em alguns detalhes sobre como criar um relatório de erro útil. Este artigo descreve que tipo de informação é útil e por que é útil.
zh: Article which goes into some detail about how to create a useful bug report. 关于如何提交有用问题报告的文章。它说明了哪些信息是有用的，为什么有用。

source: Information about writing a good bug report. Some of this is specific to the Mozilla project, but describes general good practices.
pl: Informacja o pisaniu dobrych raportów błędów. Niektóre z nich dotyczą projektu Mozilla, choć opisują ogólnie dobre zwyczaje.
pt: Informações sobre como escrever um bom relatório de erro. Algumas dessas são específicas para o projeto Mozilla, mas descrevem boas práticas em geral.
zh: Information about writing a good bug report. 关于如何撰写一份好的Bug报告的信息。其中的一些细节是指Mozilla工程的，但是但描述了一般的良好做法。
