Repository: navnit3366/pootle-python-org-backup-master
Catalog: pos/locale/python/*/glossary.po
Languages: pl

source: A function which returns an iterator. It looks like a normal function except that values are returned to the caller using a :keyword:`yield` statement instead of a :keyword:`return` statement. Generator functions often contain one or more :keyword:`for` or :keyword:`while` loops which :keyword:`yield` elements back to the caller. The function execution is stopped at the :keyword:`yield` keyword (returning the result) and is resumed there when the next element is requested by calling the :meth:`__next__` method of the returned iterator.
pl: - Zadanie, którego wynikiem jest przedmiot powtarzający wykonanie innych zadań z zawartością kolekcji. Zadanie to wygląda tak, jak zwykłe zadanie, z wyjątkiem tego, że wyniki częściowe są przekazywane na miejsce z którego nastąpiło odniesienie do zadania. Przekazanie to odbywa się z pomocą polecenia "wydawaj" ( - z ang. - :keyword: `yield`), zamiast polecenia "zwróć" ( - z ang. - :keyword:`return`). Zadania wytwarzające często zawierają jedną jedno bądź więcej poleceń "dla..." ( - z ang. - :keyword:`for`), lub "dopóki..." ( - z ang. - :keyword:`while`), które w przypadku wytwarzania zajmują się "wydawaniem" ( - z ang. :keyword:`yield`) wytworzonych przedmiotów odbiorcom znajdującym się w miejscu odniesienia do zadania wytwarzania. Wykonanie zadania wytwarzania jest zatrzymywane przy każdym napotkaniu polecenia "wydania" ( - z ang. - :keyword:`yield`) (rozumianego jako przekazania pojedynczej cząstki wynikającego zbioru rzeczy) i w tym samym miejscu jest też podejmowane na powrót, kiedy zadanie wytwarzania otrzyma wiadomość o prośbie o wydanie kolejnego przedmiotu ze zbioru wynikowego za pomocą odniesienia się do sposobu postępowania "następny" ( - z ang. - :meth:`__next__`) należącego do przedmiotu powtarzającego operację "wydania".

source: An expression that returns an iterator. It looks like a normal expression followed by a :keyword:`for` expression defining a loop variable, range, and an optional :keyword:`if` expression. The combined expression generates values for an enclosing function::
pl: Wyrażenie, którego wynikiem jest przedmiot powtarzający wykonanie zadań dla zawartości kolekcji. Wygląda tak, jak każde wyrażenie, tylko że następnym idącym za nim wyrażeniem jest polecenie "dla..." ( - z ang. - :keyword:`for`) określające nazwę posiłkową dla przedmiotów należących do kolekcji, tą właśnie kolekcję przedmiotów, i jeśli to konieczne uwagę ", jeżeli..." ( - z ang. - :keyword:`if`) określającą dodatkowe warunki które muszą być spełnione. Złożone w całość stwierdzenie powoduje wytwarzanie przedmiotów dla nadrzędnego zadania::

source: >>> sum(i*i for i in range(10)) # sum of squares 0, 1, 4, ... 81 285
pl: >>> sum(i*i for i in range(10)) # suma kwadratów 0, 1, 4, ... 81 285

source: See :term:`global interpreter lock`.
pl: Zobacz rozdział nadrzędnym zabezpieczeniu programu tłumaczącego polecenia języka pytonowskiego - z ang. - :term:`global interpreter lock`.

source: The lock used by Python threads to assure that only one thread executes in the :term:`CPython` :term:`virtual machine` at a time. This simplifies the CPython implementation by assuring that no two processes can access the same memory at the same time. Locking the entire interpreter makes it easier for the interpreter to be multi-threaded, at the expense of much of the parallelism afforded by multi-processor machines. Efforts have been made in the past to create a "free-threaded" interpreter (one which locks shared data at a much finer granularity), but so far none have been successful because performance suffered in the common single-processor case.
pl: Zabezpieczenie używane przez jednostki wykonujące polecenia języka pytonowskiego w celu zapewnienia, że tylko jedna jednostka wykonująca polecenia języka pytonowskiego działa w pośrednim urządzeniu ( - z ang. - :term:`virtual machine`) realizującym język pytonowski zwanym realizacją języka pytonowskiego w języku C ( - z ang. - :term:`CPython`) w każdym razie. To zabezpieczenie upraszcza realizację języka pytonowskiego w języku C przez zagwarantowanie, żeby w tej samej chwili dostępu do tego samego obszaru pamięci nie mogły uzyskać dwie różne jednostki wykonujące polecenia języka pytonowskiego. Zabezpieczenie całego programu tłumaczącego polecenia języka pytonowskiego ułatwia istnienie wielu jednostek wykonujących polecenia języka pytonowskiego w programie tłumaczącym polecenia języka pytonowskiego, ale za cenę większej części możliwości dostępnych dla równoczesnej pracy takich jednostek wykonywanej przez wiele fizycznych układów liczących w urządzeniach zawierających wiele takich układów pracujących równocześnie. W przeszłości podejmowano wysiłki stworzenia programu tłumaczącego polecenia języka pytonowskiego o "uwolnionym sposobie wykonywania przez jednostki wykonujące polecenia języka pytonowskiego" (w znaczeniu takiego, który zabezpiecza dostęp do spółdzielczo używanych wiadomości w skali znacznie bardziej rozdrobnionej), ale jak dotąd żadne z nich nie miały powodzenia, gdyż wykonywanie poleceń języka tym sposobem dla pojedynczego urządzenia wykonującego polecenia, było zbyt powolne.

source: An object is *hashable* if it has a hash value which never changes during its lifetime (it needs a :meth:`__hash__` method), and can be compared to other objects (it needs an :meth:`__eq__` method). Hashable objects which compare equal must have the same hash value.
pl: Przedmiot jest *możliwy do zapisania w formie skrótu*, jeśli jego skrót ma wartość, która nie zmienia się w czasie wykonywania programu (a wartość ta obliczana jest za pomocą sposobu postępowania występującego pod nazwą "skrótu" - z ang. - :meth:`__hash__`) i jeśli przedmiot może być porównywany z innymi przedmiotami (za pomocą sposobu postępowania "porównania tożsamości" - z ang. - :meth:`__eq__`). Przedmioty możliwe do zapisania w formie skrótu których wynik porównania tożsamości oznacza jednakowość tych przedmiotów muszą mieć ten sam skrót.

source: Hashability makes an object usable as a dictionary key and a set member, because these data structures use the hash value internally.
pl: Dla przedmiotu możliwość uzyskania postaci skrótu oznacza, że może być on użyty jako hasło w słowniku, lub jako element zbioru przedmiotów, gdyż obydwa systemy gromadzenia przedmiotów używają skrótów przedmiotów jako swoich wewnętrznych reprezentacji tych przedmiotów.

source: All of Python's immutable built-in objects are hashable, while no mutable containers (such as lists or dictionaries) are. Objects which are instances of user-defined classes are hashable by default; they all compare unequal, and their hash value is their :func:`id`.
pl: Wbudowane przedmioty, których wartości nie mogą się zmieniać, wszystkie bez wyjątku można zapisać w postaci skrótu, zaś spośród pojemników, których zawartość może się zmieniać, (takich jak listy i słowniki), żadnych bez wyjątku nie można zapisać w postaci skrótu. Przedmioty, które są szczególnymi przypadkami określonymi w ramach uogólnień wymyślonych na potrzeby konkretnego zastosowania, mają zawsze z założenia dostępną postać skrótu, a poza tym wyniki porównywania każdej pary takich przedmiotów w żadnym przypadku nie potwierdzą tożsamości przedmiotów z takiej pary, zaś skróty tych przedmiotów są równoważne wynikom zadania ich "identyfikacji" - z ang. - :func:`id`.

source: An Integrated Development Environment for Python. IDLE is a basic editor and interpreter environment which ships with the standard distribution of Python. Good for beginners, it also serves as clear example code for those wanting to implement a moderately sophisticated, multi-platform GUI application.
pl: Zbiorcze miejsce rozwijania programów w języku pytonowskim ( - z ang. Integrated development environment - w skrócie - IDLE). IDLE jest podstawowym programem do wprowadzania i dokonywania zmian w zapisie programu w języku pytonowskim i jego późniejszego tłumaczenia i wykonania, który jest dostarczany w podstawowym zestawie rozprowadzanego pakunku języka pytonowskiego. Dobry dla początkujących, służy także jako jasny przykład zapisu poleceń programu dla tych, którzy pragnęliby wykonać własny średniej skali skomplikowania, działający w różnych warunkach uruchamiania, program z możliwością zawiadowania obrazkowego przez uruchamiającego.

source: An object with a fixed value. Immutable objects include numbers, strings and tuples. Such an object cannot be altered. A new object has to be created if a different value has to be stored. They play an important role in places where a constant hash value is needed, for example as a key in a dictionary.
pl: Przedmiot o ustalonej wartości/zawartości. Niezmienne przedmioty obejmują liczby, napisy/teksty i pary/trójki/krotki/n-gramy. W takich przedmioty nie da się wprowadzić odmiany. Trzeba utworzyć nowy przedmiot, jeśli ma być zachowana inna wartość/zawartość/szczegół. Odgrywają istotną rolę wszędzie, gdzie ma znaczenie ich stałość, lub gdzie potrzebna jest wartość skrótowa, na przykład jako hasło w słowniku.

source: An object that both finds and loads a module; both a :term:`finder` and :term:`loader` object.
pl: Przedmiot, który zarówno odnajduje jak też zaciąga do podręcznego zapamiętania bibliotekę zadań i uogólnień. Zarówno przedmiot "odnajdujący" - z ang. - :term:`finder`, jak też "zaciągający" - z ang. - :term:`loader`.

source: Python has an interactive interpreter which means you can enter statements and expressions at the interpreter prompt, immediately execute them and see their results. Just launch ``python`` with no arguments (possibly by selecting it from your computer's main menu). It is a very powerful way to test out new ideas or inspect modules and packages (remember ``help(x)``).
pl: Język pytonowski posiada program tłumaczący polecenia, współgrający z działaniami piszącego program, co oznacza, że można wprowadzać polecenia i wyrażenia w odpowiedzi na zapytania programu tłumaczącego te polecenia, natychmiastowo wykonywać je i sprawdzać wyniki wykonania. Wystarczy tylko rozpocząć od wydania polecenia uruchomienia programu tłumaczącego polecenia języka pytonowskiego poleceniem ( - z ang. - ) ``python`` bez żadnych dodatkowych wytycznych dla niego. (Z dużym prawdopodobieństwem jest to też możliwe do osiągnięcia przez wybranie i potwierdzenie polecenia tak samo nazwanego, znajdującego się, w sprzyjających warunkach, na liście w głównym spisie narzędzi komputera). Jest to bardzo sprytny sposób wypróbowywania nowych pomysłów, lub podglądania zawartości bibliotek, programów i zestawów narzędziowych (których opisy działania można uzyskać wpisując zapytanie o "pomoc" - z ang. - ``help(x)`` gdzie x - nazwą biblioteki, zadania, czy uogólnienia).

source: Python is an interpreted language, as opposed to a compiled one, though the distinction can be blurry because of the presence of the bytecode compiler. This means that source files can be run directly without explicitly creating an executable which is then run. Interpreted languages typically have a shorter development/debug cycle than compiled ones, though their programs generally also run more slowly. See also :term:`interactive`.
pl: Język pytonowski jest językiem tłumaczonych i upraszczanych poleceń, w przeciwieństwie do języków w których całe programy są najpierw zbierane a potem dopiero tłumaczone dla urządzenia wykonującego, chociaż to rozróżnienie może się nieco rozmywać, z uwagi na występowanie w języku pytonowskim programu tłumaczącego oznaczenia poleceń dla właściwego urządzenia w podziale na równe kęsy. To powoduje, że programy napisane w języku pytonowskim mogą być włączane bezpośrednio, bez wyraźnie wydzielonego tworzenia zbioru uporządkowanych oznaczeń poleceń podstawowych zrozumiałych dla urządzenia, przez które program będzie wykonywany, a następnie jego uruchamiania. Dla języków tłumaczonych i upraszczanych obieg pomiędzy rozwojem a wprowadzaniem poprawek i na powrót, jest z reguły krótszy niż dla języków w których program jest zbierany i tłumaczony, chociaż programy napisane w tych pierwszych zasadniczo także działają bardziej powolnie. Zobacz też: "współgranie z działaniami użytkownika" - :term:`interactive`.

source: A container object capable of returning its members one at a time. Examples of iterables include all sequence types (such as :class:`list`, :class:`str`, and :class:`tuple`) and some non-sequence types like :class:`dict` and :class:`file` and objects of any classes you define with an :meth:`__iter__` or :meth:`__getitem__` method. Iterables can be used in a :keyword:`for` loop and in many other places where a sequence is needed (:func:`zip`, :func:`map`, ...). When an iterable object is passed as an argument to the built-in function :func:`iter`, it returns an iterator for the object. This iterator is good for one pass over the set of values. When using iterables, it is usually not necessary to call :func:`iter` or deal with iterator objects yourself. The ``for`` statement does that automatically for you, creating a temporary unnamed variable to hold the iterator for the duration of the loop. See also :term:`iterator`, :term:`sequence`, and :term:`generator`.
pl: Przedmiot pojemnika, zdolny wydawać zawierające się w nim przedmioty składowe po jednym na raz. Przykłady przedmiotów przeliczalnych/przechodnich zawierają wszystkie rodzaje kolejek (takie jak: listy - z ang. - :class:`list`, napisy/ciągi znaków/teksty - z ang. - :class:`str`, i pary(dwójki,trójki,krotki) - z ang. - :class:`tuple`) i niektóre przedmioty rodzaju niekolejkowego takie jak słowniki - z ang. - :class:`dict` i dokumenty - z ang. - :class:`file` i wszystkie przedmioty zaliczane do dowolnego uogólnienia, dla których zostały określone własne odrębne sposoby postępowania pod nazwami "przejdź" - z ang. - :meth:`__iter__`, lub "weź rzecz" - z ang. - :meth:`__getitem__`. Przedmioty kolekcji po których można spacerować/przechodnie mogą być używane w poleceniu powtarzania - "dla..." - z ang. - :keyword:`for` i w wielu innych sytuacjach w których potrzebna jest kolejka (np w zadaniu "spięcia" - z ang. - :func:`zip`, lub w zadaniu "wpasowania" - z ang. - :func:`map`, itp). Gdy przedmiot nadający się do przeglądania po kolei (kolejka) jest przekazywany przedmiot postępowania dla pierwotnego zadania "przechodzenia" - z ang. - :func:`iter`, wynikiem wykoniania tego zadania staje się przedmiot przechodzący po zawartości tej kolejki. Ten przechodzący przedmiot użyteczny jest przy jednokrotnym przespacerowaniu się ponad zbiorem zawartym w tej kolejce. Podczas używania przedmiotów przechodzących, zwykle nie są konieczne bezpośrednie odniesienia do zadania "przechodzenia" - z ang. - :func:`iter`, ani też nie jest wymagane własnoręczne bezpośrednie zajmowanie się przedmiotem przechodzącym. Polecenie "dla..." (- z ang. - ``for``) wykonuje to samodzielnie bez zewnętrznej ingerencji, tworząc tymczasowe nienazwane miejsce przechowywania przedmiot przechodzący na czas wykonywania wszystkich powtórzeń wykonania poleceń podrzędnych poleceniu "dla...". Zobacz także "przedmiot przechodzący" - z ang. - :term:`iterator`, kolejkę - z ang. - :term:`sequence`, i "przedmiot wytwarzający" - z ang. - :term:`generator`.

source: An object representing a stream of data. Repeated calls to the iterator's :meth:`__next__` (or passing it to the built-in function :func:`next`) method return successive items in the stream. When no more data are available a :exc:`StopIteration` exception is raised instead. At this point, the iterator object is exhausted and any further calls to its :meth:`next` method just raise :exc:`StopIteration` again. Iterators are required to have an :meth:`__iter__` method that returns the iterator object itself so every iterator is also iterable and may be used in most places where other iterables are accepted. One notable exception is code which attempts multiple iteration passes. A container object (such as a :class:`list`) produces a fresh new iterator each time you pass it to the :func:`iter` function or use it in a :keyword:`for` loop. Attempting this with an iterator will just return the same exhausted iterator object used in the previous iteration pass, making it appear like an empty container.
pl: Przedmiot służący wyobrażeniu zapisów wyłaniających się w pewnym porządku. Wynikami powtarzanego odnoszenia się do sposobu postępowania znanego pod nazwą "przejścia do następnego zapisu" - z ang. - :meth:`__next__` określonego dla przedmiotu przechodzącego (lub przekazanie owego "przedmiotu przechodzącego" do pierwotnego dla języka pytonowskiego zadania znanego również pod nazwą "przejścia do następnego zapisu" - z ang. - :func:`next`) są kolejne rzeczy pochodzące z tego uporządkowania. Gdy żaden więcej zapis nie wyłania się z uporządkowania, zamiast wyniku zadanie "przejścia do następnego przedmiotu" ogłasza sytuację nadzwyczajną o nazwie "zatrzymania powtórzeń" - z ang. - :exc:`StopIteration`. W tym momencie, przedmiot przechodzący staje się również "pusty/wyczerpany" i każde następne odniesienie się do sposobu postępowania "przejścia do następnej rzeczy" - z ang. - :meth:`next` po prostu spowoduje ponowne ogłoszenie sytuacji nadzwyczajnej "zatrzymania powtórzeń" - z ang. - :exc:`StopIteration`. Wymaga się aby przedmioty przechodzące miały określony sposób postępowania "wtórnego przedmiotu przechodzącego" :meth:`__iter__` którego wynikiem ma być sam przedmiot przechodzący, tak aby każdy przedmiot przechodzący mógł także być przeglądany jak kolejka, którą sam przegląda i mógł być użyty w większości tych przypadków, w których inne przedmioty po których można przechodzić/przeliczalne są oczekiwane. Jednym znaczącym wyjątkiem jest program który próbowałby wielokrotnego przeglądania tych samych elementów. Przedmiot pojemnika - w znaczeniu kolekcji - w znaczeniu kolejki (taki, jak uogólniona lista - z ang. - :class:`list`) wytwarza za każdym razem nowy przedmiot przechodzący dla tej kolejki, za każdym razem gdy jest ona przekazywana jako przedmiot na którym ma zostać wykonane zadanie "przechodzenia do kolejnych przedmiotów w kolejce" - z ang. - :func:`iter` lub ma być użyta jako kolejka dla której przedmiotów będą wykonywane powtórzenia polecenia powtarzania "dla..." - :keyword:`for`. Próbowanie tych samych konstrukcji z przedmiotem przechodzącym po przedmiotach należących do kolejki zamiast niej samej, spowoduje tylko użycie tego samego "opuszczonego - wyczerpanego po jednorazowym przejściu" przedmiotu przechodzącego który "zużyty" został w poprzedniej turze powtórzeń na przejścia do wszystkich elementów kolejki, sprawiając że za drugim razem wygląda on tak jakby był pustym pojemnikiem lub jakby pojemnik po którym ma przechodzić jest pusty.

source: More information can be found in :ref:`typeiter`.
pl: Więcej szczegółów można znaleźć pod hasłem "uogólnienia powtarzającego" - z ang. - :ref:`typeiter`.

source: Arguments which are preceded with a ``variable_name=`` in the call. The variable name designates the local name in the function to which the value is assigned. ``**`` is used to accept or pass a dictionary of keyword arguments. See :term:`argument`.
pl: Wytyczne które są poprzedzone wyrażeniem "nazwa_wytycznej=" - z ang. - ``variable_name=`` w odniesieniu do zadania. Nazwa wytycznej wyznacza nazwę widoczną tylko we wnętrzu zadania do której przedmiot podany dla wytycznej jest przyporządkowywany. symbol dwóch gwiazdek ``**`` jest używany aby wyznaczyć miejsce lub zamiar przekazania słownika w którym będą uporządkowane wytyczne o kluczowych nazwach. Zobacz też hasło "wytyczna" - z ang. - :term:`argument`.

source: An anonymous inline function consisting of a single :term:`expression` which is evaluated when the function is called. The syntax to create a lambda function is ``lambda [arguments]: expression``
pl: Zadanie wpisane "na gorąco" nie posiadające nazwy, składające się z pojedynczego wyrażenia - z ang. - :term:`expression`, które jest obliczane gdy rozpoczyna się wykonanie zadania. Składnią tworzenia zadania "lambda" jest ``lambda [wytyczne]: wyrażenie``.

source: Look before you leap. This coding style explicitly tests for pre-conditions before making calls or lookups. This style contrasts with the :term:`EAFP` approach and is characterized by the presence of many :keyword:`if` statements.
pl: "Patrz gdzie stąpasz zanim nadepniesz". Ten zwyczaj pisania programów zaleca wyraźnie odgórne sprawdzanie warunków wstępnych przed wykonaniem jakichkolwiek odniesień do zadań lub do podglądanych ściągawek. Ten zwyczaj różni się od podejścia o nazwie "lepiej proś o przebaczenie niż o pozwolenie" - z ang. - "easier ask forgiveness than please" :term:`EAFP` i cechuje się obecnością wielu stwierdzeń "jeżeli coś to coś, a jeżeli nie to coś innego, itp" - z ang. - :keyword:`if`.

source: A built-in Python :term:`sequence`. Despite its name it is more akin to an array in other languages than to a linked list since access to elements are O(1).
pl: Pierwotna dla języka pytonowskiego kolejka - z ang. - :term:`sequence`. Pomimo swojej nazwy jest ona bardziej podobna do macierzy tak jak w innych językach niż do wiązanej listy z racji dostępu do poszczególnych rzeczy w niej zawartych w jednostkowym czasie wykonania - O(1).

source: A compact way to process all or part of the elements in a sequence and return a list with the results. ``result = ['{:#04x}'.format(x) for x in range(256) if x % 2 == 0]`` generates a list of strings containing even hex numbers (0x..) in the range from 0 to 255. The :keyword:`if` clause is optional. If omitted, all elements in ``range(256)`` are processed.
pl: Zwarty sposób działania na wszystkich lub części rzeczy z kolejki i sporządzania spis zawierający wyniki tych działań. ``result = ['{:#04x}'.format(x) for x in range(256) if x%2 == 0]`` wytwarza spis napisów zawierających parzyste liczby o podstawie szesnastkowej (0x..) w przedziale od 0 do 255. warunek "jeżeli" - z ang. - :keyword:`if` może występować jeśli zajdzie taka potrzeba. Jeśli pominięty, wszystkie liczby z danego zakresu (``range(256)``) zostaną wzięte pod uwagę.

source: An object that loads a module. It must define a method named :meth:`load_module`. A loader is typically returned by a :term:`finder`. See :pep:`302` for details and :class:`importlib.abc.Loader` for an :term:`abstract base class`.
pl: Przedmiot którego podprogram wbudowuje zawartość biblioteki w miejsce późniejszego podręcznego z niej korzystania. Taki przedmiot zwykle zawiera określenie sposobu postępowania podczas wbudowywania zawartości takiej biblioteki w miejsce późniejszego podręcznego z niej korzystania pod nazwą "wbudowania zawartości biblioteki w miejsce podręcznego z niej korzystania" - z ang. - :meth:`load_module`. Przedmiot zawierający podprogram którym wbudowuje się bibliotekę w miejsce późniejszego z niej korzystania jest zwykle wynikiem działania przedmiotu znanego pod nazwą "podprogramu poszukującego biblioteki o podanej nazwie" - z ang. - :term:`finder`. Sięgnij do opisu "propozycji rozszerzenia języka pytonowskiego" nr. 302 z ang. :pep:`302` po opis szczegółów i do uogólnienia przedmiotu wbudowującego zawartość biblioteki w miejsce późniejszego z niej korzystania występującego pod nazwą - z ang. - :class:`importlib.abc.Loader` po opis podstawowego uogólnienia ramowego - z ang. - :term:`abstract base class`.

source: A container object (such as :class:`dict`) which supports arbitrary key lookups using the special method :meth:`__getitem__`.
pl: Przedmiot pojemnika (taki jak słownik - z ang. - :class:`dict`), który umożliwia podglądanie według zadanych haseł przy użyciu przewidzianego do tego celu sposobu postępowania "wzięcia wpisu" - z ang. - :meth:`__getitem__`.
