Repository: navnit3366/pootle-python-org-backup-master
Catalog: pos/locale/python/*/glossary.po
Languages: pl

source: Glossary
pl: Słowniczek

source: The default Python prompt of the interactive shell. Often seen for code examples which can be executed interactively in the interpreter.
pl: Domyślne słowo zachęty wspólnie wykonywanego programu interpretującego polecenia dla języka Pyton. Często spotykany w przykładach kodu, które mogą być wykonywane przy współpracy z programem ujednoznaczniającym polecenia dla komputera.

source: The default Python prompt of the interactive shell when entering code for an indented code block or within a pair of matching left and right delimiters (parentheses, square brackets or curly braces).
pl: Domyślne słowo zachęty wspólnie wykonywanego programu interpretującego polecenia języka Pyton podczas wprowadzania zapisów we wciętym zestawie poleceń lub w zakresie pomiędzy lewym i prawym znakiem rozdzielającym (nawiasem, nawiasem prostokątnym lub nawiasem klamrowym).

source: A tool that tries to convert Python 2.x code to Python 3.x code by handling most of the incompatibilites which can be detected by parsing the source and traversing the parse tree.
pl: Narzędzie, które próbuje zamienić program napisany w odmianie Pytona 2 na odpowiednik zapisany w odmianie Pytona 3, poprzez obsługę większości różnic między wersjami, które mogą zostać wykryte przez przeanalizowanie pierwotnego programu i przegląd zawartości struktury rozłożonego programu.

source: 2to3 is available in the standard library as :mod:`lib2to3`; a standalone entry point is provided as :file:`Tools/scripts/2to3`. See :ref:`2to3-reference`.
pl: moduł 2to3 jest osiągalny przez bibliotece szablonów, jako moduł :mod​​:`lib2to3`; punkt wolnego dostępu do modułu jest określony przez podprogram :file:`Tools/scripts/2to3`. Zobacz też: :ref:`2to3-reference`.

source: Abstract Base Classes (abbreviated ABCs) complement :term:`duck-typing` by providing a way to define interfaces when other techniques like :func:`hasattr` would be clumsy. Python comes with many built-in ABCs for data structures (in the :mod:`collections` module), numbers (in the :mod:`numbers` module), and streams (in the :mod:`io` module). You can create your own ABC with the :mod:`abc` module.
pl: Podstawowe uogólnienia ramowe (w skrócie ang. - ABC) uzupełniają zwyczaj "kaczego typowania" ang. :term:`duck-typing` zapewniając możliwość określenia sposobów dostępu, gdy inne techniki, takie jak odnośnik "mawłasność" ang. - :func:`hasattr` byłyby niezręczne. Język pytonowski posiada wiele wbudowanych ramowych uogólnień podstawowych dla tworzenia struktur przechowywania informacji(w module kolekcje ang. :mod:`collections`), liczb (w module liczby :mod:`numbers`), i dla operacji szeregowanych (w module wejścia/wyjścia ang. :mod:`io`). Można tworzyć swoje własne ramowe uogólnienia podstawowe używając modułu :mod:`abc`.

source: A value passed to a function or method, assigned to a named local variable in the function body. A function or method may have both positional arguments and keyword arguments in its definition. Positional and keyword arguments may be variable-length: ``*`` accepts or passes (if in the function definition or call) several positional arguments in a list, while ``**`` does the same for keyword arguments in a dictionary.
pl: Wartość przekazana do zadania lub sposobu postępowania, przypisana do lokalnej nazwy we wnętrzu deklaracji zadania. Zadanie lub sposób postępowania może przyjmować na wejściu zarówno zapisy pozycyjne jak i zapisy słów kluczowych podczas definiowania. zapisy pozycyjne i zapisy słów kluczowych mogą być zmiennej długości: ``*`` przyjmuje lub przekazuje do przyjęcia (jeżeli znajduje się w definicji zadania lub w wywołaniu) kilka wytycznych z listy, podczas gdy ``**`` robi to samo dla kluczy słownika.

source: Any expression may be used within the argument list, and the evaluated value is passed to the local variable.
pl: Dowolne wyrażenie może być użyte jako element listy zapisów wejściowych zadania, a obliczona wartość będzie przekazana do zapisania lokalnego.

source: A value associated with an object which is referenced by name using dotted expressions. For example, if an object *o* has an attribute *a* it would be referenced as *o.a*.
pl: Wartość związana z przedmiotem, do którego odwołanie następuje przez nazwę przy użyciu kropkowanych wyrażeń. Na przykład, jeśli przedmiot *p* ma atrybut *a* to można się do niego odwołać przez *p.a*.

source: Benevolent Dictator For Life, a.k.a. `Guido van Rossum <http://www.python.org/~guido/>`_, Python's creator.
pl: Dożywotnio tytułowany "dobrotliwym szaleńcem" - 'Gwidon van Rossum <http://www.python.org/~guido/>'_, pomysłodawca języka pytonowskiego.

source: Python source code is compiled into bytecode, the internal representation of a Python program in the interpreter. The bytecode is also cached in ``.pyc`` and ``.pyo`` files so that executing the same file is faster the second time (recompilation from source to bytecode can be avoided). This "intermediate language" is said to run on a :term:`virtual machine` that executes the machine code corresponding to each bytecode.
pl: Polecenia programu w języku pytonowskim są zamieniane na postać kodów ułożonych w równych kęsach, jako wewnętrznej reprezentacji programu pytonowskiego w programie wczytującym polecenia dla komputera. kody zebrane z kęsów są zapamiętywane tymczasowo w plikach o nazwach zakończonych rozszerzeniem ``.pyc`` i ``.pyo`` po to, aby następnym razem ten sam program mógł być wykonany szybciej (można w ten sposób uniknąć ponownego tłumaczenia programu do postaci kodów ułożonych w kęsy). Jest to "język pośredni" o którym mówi się, że jego polecenia są wykonywane na sztucznej maszynie (ang. :term:`virtual machine`), która wykonuje polecenia maszyny odpowiadające pojedynczym kodom w kęsach.

source: A template for creating user-defined objects. Class definitions normally contain method definitions which operate on instances of the class.
pl: Szablon do tworzenia przedmiotów określonych przez użytkownika. Uogólnienia zwykle zawierają opisy sposobów postępowania, które mają zastosowanie dla konkretnych przypadków przedmiotów w danym uogólnieniu.

source: The implicit conversion of an instance of one type to another during an operation which involves two arguments of the same type. For example, ``int(3.15)`` converts the floating point number to the integer ``3``, but in ``3+4.5``, each argument is of a different type (one int, one float), and both must be converted to the same type before they can be added or it will raise a ``TypeError``. Without coercion, all arguments of even compatible types would have to be normalized to the same value by the programmer, e.g., ``float(3)+4.5`` rather than just ``3+4.5``.
pl: Niejawne przemianowanie typu konkretnego przedmiotu z jednego typu do drugiego w trakcie operacji, która jest wykonywana na dwóch przedmiotach o oczekiwanym jednakowym typie na wejściu. Na przykład: ``int(3.15)`` konwertuje liczbę zmiennoprzecinkową do całkowitej ``3``, ale w przypadku ``3+4.5``, każda rzecz jest innego typu (pierwsza liczbą całkowitą, a druga liczbą rzeczywistą), i obie muszą być tego samego typu, zanim będą mogły być dodane. Jeśli zamiana nie jest możliwa, zostanie zgłoszony wyjątek "błąd typu" (ang. ``TypeError``). Bez automatycznej zmiany typu, wszystkie rzeczy na wejściu nawet podobnych typów, musiałyby zostać zamienione do rzeczy tego samego typu przez piszącego program, np. trzeba by napisać ``float(3)+4.5``, zamiast tylko ``3+4.5``.

source: An extension of the familiar real number system in which all numbers are expressed as a sum of a real part and an imaginary part. Imaginary numbers are real multiples of the imaginary unit (the square root of ``-1``), often written ``i`` in mathematics or ``j`` in engineering. Python has built-in support for complex numbers, which are written with this latter notation; the imaginary part is written with a ``j`` suffix, e.g., ``3+1j``. To get access to complex equivalents of the :mod:`math` module, use :mod:`cmath`. Use of complex numbers is a fairly advanced mathematical feature. If you're not aware of a need for them, it's almost certain you can safely ignore them.
pl: Rozszerzenie znanego systemu liczb rzeczywistych, do postaci zespolonej w której wszystkie liczby są wyrażone jako suma części rzeczywistej i urojonej. Liczby urojone są rzeczywistymi wielokrotnościami jednostki urojonej (pierwiastek kwadratowy z liczby ``-1``), często zapisywany jako ``i`` w matematyce lub ``j`` w inżynierii. Język Pyton liczby zespolone traktuje jako część języka, i przyjęty został ten drugi zapis, w którym część urojona jest zapisywana z dodaniem litery ``j``, np. ``3+1j``. Aby uzyskać zespolone równoważniki zadań biblioteki matematycznej (biblioteka matematyczna - z ang. - :mod​​: `math`), użyj biblioteki matematycznej z c - z ang. - biblioteka :mod​​: `cmath`. Zastosowanie liczb zespolonych jest całkiem skomplikowaną sprawą w matematyce. Jeśli nie czujesz konieczności ich użycia, to raczej pewne, że nie są ci potrzebne.

source: An object which controls the environment seen in a :keyword:`with` statement by defining :meth:`__enter__` and :meth:`__exit__` methods. See :pep:`343`.
pl: Nazwana rzecz, która wpływa na zbiór nazw dostępnych w obszarze zawartym pomiędzy początkiem polecenia ``z`` ( - ang. :keyword:`with`), a jego końcem, przez określenie sposobów postępowania przy rozpoczynaniu wykonania ( - ang. :meth:`__enter__`) zbioru poleceń zawartych w poleceniu ``z`` i sposobu postępowania przy kończeniu ich wykonania ( - ang. :meth:`__exit__`). Zobacz też :pep:`343`.

source: The canonical implementation of the Python programming language. The term "CPython" is used in contexts when necessary to distinguish this implementation from others such as Jython or IronPython.
pl: Zasadnicze urzeczywistnienie zbioru zasad pytonowskiego języka programowania. Określenie "CPyton" ( - CPython), jest używane gdy trzeba odróżnić to urzeczywistnienie zbioru zasad pytonowskiego języka od innych, takich jak "Pyton javowy" ( - "Jython"), lub "żelazny Pyton" ( - "IronPython").

source: A function returning another function, usually applied as a function transformation using the ``@wrapper`` syntax. Common examples for decorators are :func:`classmethod` and :func:`staticmethod`.
pl: zadanie którego wynikiem jest następne zadanie, zazwyczaj stosowane jako przekształcenie tego drugiego zadania z użyciem składni opakowującej w opakowanie ( - ``@wrapper``). Przykładami powszechnych zadań dla wszystkich opakowań są zadanie "sposobu postępowania dla uogólnienia" ( - z ang. :func:`classmethod`) i zadanie "niezmiennego wspólnego sposobu postępowania" ( - z ang. :func:`staticmethod`).

source: The decorator syntax is merely syntactic sugar, the following two function definitions are semantically equivalent::
pl: Składnia opakowania jest niczym więcej, niż lukrem składniowym. Równoważne pod względem budowy są określenia dwóch następujących zadań ::

source: def f(...): ... f = staticmethod(f) @staticmethod def f(...): ...
pl: "def f(...): ... f = staticmethod(f)" oraz "@staticmethod def f(...): ..."

source: The same concept exists for classes, but is less commonly used there. See the documentation for :ref:`function definitions <function>` and :ref:`class definitions <class>` for more about decorators.
pl: Ta sama zasada ma zastosowanie dla uogólnień, ale jest rzadziej spotykana. Sięgnij do rozdziału podręcznika dotyczącego określania zadań (z ang. - :ref:`function definitions <function>`) i określania uogólnień (z ang - :ref:`class definitions <class>`), po więcej o opakowaniach.

source: Any object which defines the methods :meth:`__get__`, :meth:`__set__`, or :meth:`__delete__`. When a class attribute is a descriptor, its special binding behavior is triggered upon attribute lookup. Normally, using *a.b* to get, set or delete an attribute looks up the object named *b* in the class dictionary for *a*, but if *b* is a descriptor, the respective descriptor method gets called. Understanding descriptors is a key to a deep understanding of Python because they are the basis for many features including functions, methods, properties, class methods, static methods, and reference to super classes.
pl: - Każdy przedmiot, który określa sposoby postępowania - "pozyskania" ( z ang. - :meth:`__get__`), "ustawienia" ( z ang. - :meth:`__set__`), lub "usunięcia" ( z ang. -:meth:`__delete__`). Kiedy własnością uogólnienia jest inne uogólnienie o sposobach postępowania właściwych katalogowaniu, zamiast zwykłych sposobów postępowania "pozyskania", "ustawienia", "usunięcia" - przywoływane są jego powiązane specjalnie określone odmiany tych sposobów postępowania, podczas sprawdzenia własności w spisie własności. Zwykle, gdy posługujemy się odniesieniem *a.b*, aby pozyskać, ustawić, lub usunąć własność, przedmiot nazwany *b* jest odszukiwany w spisie własności uogólnienia *a*, ale jeśli *b* jest uogólnieniem które zawiera określenie katalogowych sposobów postępowania, to jest przywoływany odpowiadający danemu sposobowi postępowania sposób postępowania dla tego uogólnienia o katalogowych sposobach postępowania. Zrozumienie katalogowych sposobów postępowania jest kluczem do właściwego zrozumienia języka Pyton, ponieważ są one podstawą wielu szczególnych zachowań, w tym zadań, sposobów postępowania, właściwości, sposobów postępowania uogólnień i wspólnych sposobów postępowania dla danego uogólnienia, oraz odniesień do uogólnień nadrzędnych dla danego.

source: For more information about descriptors' methods, see :ref:`descriptors`.
pl: Po więcej wiadomości o katalogowych sposobach postępowania, sięgnij do rozdziału o uogólnieniach katalogowych ( z ang. - :ref:`descriptors`).

source: An associative array, where arbitrary keys are mapped to values. The use of :class:`dict` closely resembles that for :class:`list`, but the keys can be any object with a :meth:`__hash__` function, not just integers. Called a hash in Perl.
pl: - Tabela powiązań, w której za pomocą ustalonych kluczy można odnieść się do przyporządkowanych im przedmiotów. W codziennym użyciu uogólnienie tabeli powiązań (in. słownika - z ang. - :class:`dict`) bardzo przypomina użycie uogólnienia listy ( - z ang. - :class:`list`), ale kluczem uogólnienia słownika może być każdy przedmiot dla którego został określony sposób obliczania skrótu tego przedmiotu ( - z ang. - :meth:`__hash__`), nie tylko liczba całkowita. A w języku Perl uogólnienie słownika nazywane jest właśnie skrótem ( - z ang. - hash).

source: A string literal which appears as the first expression in a class, function or module. While ignored when the suite is executed, it is recognized by the compiler and put into the :attr:`__doc__` attribute of the enclosing class, function or module. Since it is available via introspection, it is the canonical place for documentation of the object.
pl: Zapis, który pojawia się jako pierwszy w uogólnieniu, zadaniu lub bibliotece zadań i uogólnień. Ignorowany podczas wykonywania zestawu poleceń, ale rozpoznawany przez program tłumaczący kod i wprowadzony do własności "dokumentacji" - z ang. - :attr:`__doc__` dla otaczającego uogólnienia, zadania lub biblioteki zadań i uogólnień. Ponieważ zapis ten jest dostępny poprzez wgląd w zawartość programu, to jest to zasadnicze miejsce dla udokumentowania przedmiotu.

source: A pythonic programming style which determines an object's type by inspection of its method or attribute signature rather than by explicit relationship to some type object ("If it looks like a duck and quacks like a duck, it must be a duck.") By emphasizing interfaces rather than specific types, well-designed code improves its flexibility by allowing polymorphic substitution. Duck-typing avoids tests using :func:`type` or :func:`isinstance`. (Note, however, that duck-typing can be complemented with abstract base classes.) Instead, it typically employs :func:`hasattr` tests or :term:`EAFP` programming.
pl: Zwyczaj programowania w języku pytonowskim, w którym ustalenie rodzaju przedmiotu dokonuje się poprzez sprawdzenie określonych dla niego sposobów postępowania lub zestawów własności, a nie na podstawie wyraźnego odniesienia do jakiejś nazwy rodzaju przedmiotu (Zgodnie z powiedzeniem: "Jeśli wygląda, jak kaczka i kwacze, jak kaczka, to może to jest kaczka"). Podkreślając znaczenie tego jakie dana rzecz ma własności i co robi, a nie odwołania do uogólnienia jakiegoś przedmiotu, dobrze pomyślany program może mieć większą wszechstronność, umożliwiając podstawienia przedmiotów o zróżnicowanym pochodzeniu. "Kacze uogólnianie" unika sprawdzania uogólnionego rodzaju przedmiotu przy użyciu zadania "określenia rodzaju" ( - z ang. - :func:`type`), a także zadania "określenia czy przedmiot przynależy do szerszego uogólnienia" ( - z ang. - :func:`isinstance`). (Należy jednak zwrócić uwagę na to, że "kacze uogólnianie" może być uzupełnione nadrzędnymi uogólnieniami podstawowymi). Zamiast tych zadań "kacze uogólnianie" zazwyczaj posługuje się sprawdzeniami "czy przedmiot posiada jakąś właśność" ( - z ang. - :func:`hasattr`) lub zasadą - "łatwiej przepraszać niż prosić o pozwolenie" ( - z ang. - :term:`EAFP`).

source: Easier to ask for forgiveness than permission. This common Python coding style assumes the existence of valid keys or attributes and catches exceptions if the assumption proves false. This clean and fast style is characterized by the presence of many :keyword:`try` and :keyword:`except` statements. The technique contrasts with the :term:`LBYL` style common to many other languages such as C.
pl: Zasada - "łatwiej przepraszać niż prosić o pozwolenie". - Wspólna dla pytonowskiego języka maniera, zgodnie z którą program spodziewa się znaleźć prawidłowe odwołania i właściwości, ale określa też postępowanie dla sytuacji wyjątkowych jeśli znalezienie odwołań lub właściwości się nie powiedzie. Ten zwyczaj przyczynia się do oszczędności i poprawenia sprawności wykonywanych programów i cechuje się częstym użyciem zadania "spróbowania" ( - z ang. - :keyword:`try`) i zadania "określenia sytuacji wyjątkowych" ( - z ang. - :keyword:`except`). Zwyczaj ten jest odmienny w stosunku do zwyczaju "patrz gdzie idziesz" ( - z ang. "look before you leap" - :term:`LBYL`) znanego z wielu języków takich, jak np. C.

source: A piece of syntax which can be evaluated to some value. In other words, an expression is an accumulation of expression elements like literals, names, attribute access, operators or function calls which all return a value. In contrast to many other languages, not all language constructs are expressions. There are also :term:`statement`\s which cannot be used as expressions, such as :keyword:`if`. Assignments are also statements, not expressions.
pl: Wyrażenie, którego wartość może zostać obliczona. Innymi słowy, wyrażenie jest zbiorem składników wyrażenia takich, jak zapisy wartości, zapisy nazw, odwołania do własności przedmiotów, symbole operacji i odwołania do zadań - wszystkiego, co niesie jakąś wartość. W przeciwieństwie do niektórych innych języków, nie wszystkie zapisy języka są wyrażeniami. Istnieją też "polecenia" ( - z ang. - :term:`statement`\s), które nie mogą być stosowane jako wyrażenia, takie jak "jeżeli" ( - z ang. - :keyword:`if`). Także przypisanie wartości jest poleceniem, a nie wyrażeniem (gdyż wynikiem owego przypisania nie jest żadna wartość tylko fakt przekazania wartości, który nie ma w języku pytonowskim swojego odpowiednika).

source: A module written in C or C++, using Python's C API to interact with the core and with user code.
pl: Fragment utworzony za pomocą języka C lub języka C++, z wykorzystaniem odniesień do sposobów dostępu do zadań z języka C, służących do tworzenia podprogramów, współgrających z zadaniami pytonowskimi i programem stworzonym dla konkretnego zastosowania.

source: An object that tries to find the :term:`loader` for a module. It must implement a method named :meth:`find_module`. See :pep:`302` for details and :class:`importlib.abc.Finder` for an :term:`abstract base class`.
pl: Przedmiot, którego zadaniem jest próba odnalezienia zadania ładującego moduł ( - z ang. - :term:`loader`). Przedmiot wymaga urzeczywistnienia sposobu postępowania znanego pod nazwą "znajdź moduł" ( - z ang. - :meth:`find_module`). Po więcej szczegółów sięgnij do propozycji rozszerzeń języka pytonowskiego ( - ang. :pep:`302​​`), a po podstawowe uogólnienie ramowe ( - z ang. - :term:`abstract base class`) sięgnij do opisu uogólnienia :class:`importlib.abc.Finder`.

source: Mathematical division discarding any remainder. The floor division operator is ``//``. For example, the expression ``11//4`` evaluates to ``2`` in contrast to the ``2.75`` returned by float true division.
pl: Matematyczne dzielenie nieuwzględniające reszty. Symbolem dzielenia z zaniedbaniem części ułamkowej jest symbol podwójnego ukośnika (``//``). Na przykład wynikiem przeliczenia zapisu ``11//4`` jest ``2``, a nie ``2,75``, które byłoby wynikiem prawdziwego dzielenia na liczbach o pływającym przecinku.

source: A series of statements which returns some value to a caller. It can also be passed zero or more arguments which may be used in the execution of the body. See also :term:`argument` and :term:`method`.
pl: Zestaw poleceń, z którego wypływa pewna wartość przekazywana do miejsca odwołania. Może także (ale nie musi) otrzymywać pewne wytyczne, które mogą zostać wykorzystane przy okazji wykonywania owego zestawu poleceń. Zob. też: "wytyczne" ( - z ang. - :term:`argument`) i "sposób postępowania" ( - z ang. - :term:`method`).

source: A pseudo module which programmers can use to enable new language features which are not compatible with the current interpreter.
pl: Zastępcza jednostka zbiorcza, z której piszący program mogą skorzystać dla włączenia do niego nowych właściwości języka, które nie są jeszcze zgodne z obecnym programem tłumaczącym język.

source: By importing the :mod:`__future__` module and evaluating its variables, you can see when a new feature was first added to the language and when it becomes the default::
pl: Wykorzystując zawartość zapakowaną w pakunku o nazwie "przyszłe" ( - z ang. - :mod:`__future__`) i sprawdzając wykazywane wartości przyporządkowane różnym własnościom pytonowskiego języka, można dowiedzieć się, kiedy ich dodanie do języka zostało zaproponowane i od zaczęły one obowiązywać na stałe::

source: The process of freeing memory when it is not used anymore. Python performs garbage collection via reference counting and a cyclic garbage collector that is able to detect and break reference cycles.
pl: Przemiana oznaczenia obszarów pamięci jako nie zajętych, gdy ich zawartość nie jest już potrzebna. Język pytonowski wykonuje zbieranie niepotrzebnych rzeczy w celu ich usunięcia, przy pomocy liczenia odniesień i wielokrotnie powtarzanego usuwania, które ma możliwość wykrywania i przerywania wielokrotnie powtarzających się odniesień.
