Repository: navnit3366/pootle-python-org-backup-master
Catalog: pos/locale/python/*/glossary.po
Languages: pl

source: The class of a class. Class definitions create a class name, a class dictionary, and a list of base classes. The metaclass is responsible for taking those three arguments and creating the class. Most object oriented programming languages provide a default implementation. What makes Python special is that it is possible to create custom metaclasses. Most users never need this tool, but when the need arises, metaclasses can provide powerful, elegant solutions. They have been used for logging attribute access, adding thread-safety, tracking object creation, implementing singletons, and many other tasks.
pl: Uogólnienie wszystkich rodzajów uogólnień. założenia uogólnień przewidują nazwę uogólnienia, słownik uogólnienia, i spis uogólnień leżących u podstaw. uogólnienie w swoim szerszym znaczeniu zajmuje się zbieraniem trzech założeń tworzących uogólnienia i następnie tworzeniem według nich wynikającego uogólnienia. Większość języków ukierunkowanych przedmiotowo zastrzega swoje podstawowe określenie wykonania uogólnienia wszystkich uogólnień. Język pytonowski stał się jednak wyjątkowy za sprawą umożliwienia tworzenia uogólnień wyższego rzędu (opisujących zasady tworzenia podstawowych uogólnień) według dowolnego własnego pomysłu. Większość stykających się z tą własnością języka pytonowskiego zwykle nie potrzebuje takiego narzędzia, ale gdy zajdzie potrzeba, uogólnienia wyższego poziomu mogą zapewnić pewne, dopracowane rozwiązania. Były już użyte do notowania dostępu do własności uogólnień, dodania zabezpieczeń współdzielenia, pilnowania kiedy przedmiotów są tworzone, urzeczywistniania przedmiotów jedynych w swoim rodzaju, i wielu innych rozwiązań zaspokajających różnorakie potrzeby.

source: More information can be found in :ref:`metaclasses`.
pl: Więcej wiadomości na temat uogólnień opisujących w szerszym znaczeniu sposoby tworzenia uogólnień można znaleźć w rozdziale dotyczącym "szerszych uogólnień" - z ang. - :ref:`metaclasses`.

source: A function which is defined inside a class body. If called as an attribute of an instance of that class, the method will get the instance object as its first :term:`argument` (which is usually called ``self``). See :term:`function` and :term:`nested scope`.
pl: Zadanie które jest określone jako wewnętrzne względem uogólnienia. Kiedy pojawi się odniesienie do niego jako do własności przedmiotu będącego przykładem tego uogólnienia, ten sposób postępowania otrzyma ten konkretny przedmiot jako pierwszą "wytyczną" do wykonania ( - z ang. - :term:`argument`) (który często nazywany jest "onym samym" ``self``). Zobacz też hasła "zadanie" ( - z ang. - :term:`function`) i "wewnętrzny odziedziczony zakres widoczności" ( - z ang. - :term:`nested scope`).

source: Mutable objects can change their value but keep their :func:`id`. See also :term:`immutable`.
pl: Przedmioty, których zawartość może ulec zmianie, mogą mieć zmienianą zawartość a swoją tożsamość ( - z ang. - :func:`id`) utrzymywać niezmienioną. Zobacz też: "przedmioty nie ulegające zmianom" ( - z ang. - :term:`immutable`).

source: Any tuple-like class whose indexable elements are also accessible using named attributes (for example, :func:`time.localtime` returns a tuple-like object where the *year* is accessible either with an index such as ``t[0]`` or with a named attribute like ``t.tm_year``).
pl: Każde uogólnienie o charakterze przedmiotu wielokrotnego (pary/dwójki/trójki przedmiotów pojedynczych), których kolejno uporządkowane przedmioty przyporządkowane kolejnym liczbom naturalnym, dostępne są także przy użyciu właściwości o ustalonych nazwach (na przykład, wynikiem wykonania zadania "podania czasu w danej strefie czasowej" - :func:`time.localtime` jest przedmiot kolekcji o charakterze przedmiotu składającego się z wielu przedmiotów, w którym właściwość oznaczająca *rok* jest dostępna zarówno przez odniesienie do przedmiotu zawartego w kolekcji na podanej pozycji - czyli na pierwszej pozycji w przypadku *roku* oznaczonej liczbą porządkową zero - tutaj jako odniesienie ``t[0]`` lub przy użyciu nazwanej właściwości takiej, jaką dla tego przypadku jest "rok" - z ang. - ``t.tm_year`` gdzie t oznacza wynik wykonania zadania pobrania czasu w danej strefie czasowej.

source: A named tuple can be a built-in type such as :class:`time.struct_time`, or it can be created with a regular class definition. A full featured named tuple can also be created with the factory function :func:`collections.namedtuple`. The latter approach automatically provides extra features such as a self-documenting representation like ``Employee(name='jones', title='programmer')``.
pl: Nazwany przedmiot wielokrotny może być rodzaju uogólnienia pierwotnego dla języka tak, jak np. uogólnienie określające czas - :class:`time.struct_time`, lub może być utworzony przy użyciu zwykłego planu uogólnienia. Pełnoprawny nazwany przedmiot wielokrotny może być także utworzony za pomocą zadania tworzenia nazwanego przedmiotu wielokrotnego ( - z ang. - :func:`collections.namedtuple`). To ostatnie podejście dostarcza także dodatkowe możliwości takie jak np. postać z od razu załączanymi objaśnieniami pochodzącymi bezpośrednio z wyrażeń (w rodzaju: ``Pracownik(nazwisko='kowalski', rola='piszący programy')`` - z ang. - ``Employee(name='jones', title='programmer')``).

source: The place where a variable is stored. Namespaces are implemented as dictionaries. There are the local, global and built-in namespaces as well as nested namespaces in objects (in methods). Namespaces support modularity by preventing naming conflicts. For instance, the functions :func:`builtins.open` and :func:`os.open` are distinguished by their namespaces. Namespaces also aid readability and maintainability by making it clear which module implements a function. For instance, writing :func:`random.seed` or :func:`itertools.izip` makes it clear that those functions are implemented by the :mod:`random` and :mod:`itertools` modules, respectively.
pl: Miejsce gdzie nazwany przedmiot jest przechowywany. Przestrzenie nazw są wykonane przy pomocy słowników. Istnieją miejscowe przestrzenie nazw, wszechobecne i właściwe językowi a także dostępne tylko od wewnątrz przedmiotu (z wnętrza jego planów działania). Przestrzenie nazw ułatwiają podzielność na części przez zapobieganie niezgodnościom w nazywaniu przedmiotów. Dla przykładu, zadania "otwierania zawartości (właściwego dla języka)" - z ang. - :func:`builtins.open` i "otwierania zawartości (właściwego dla zasad działania programów podstawowych)" - z ang. - :func:`os.open` można wzajemnie rozróżnić w odniesieniu do przestrzeni nazw tych zadań. Przestrzenie nazw poprawiają także zrozumiałość zapisów i ułatwiają wprowadzanie zmian w zapisie programu i jego działaniu przez jasne wskazywanie, które biblioteki/zbiory zadań i uogólnień zawierają określone zadania w ich szczególnym dla tych zbiorów zadań i uogólnień wykonaniu. Na przykład napisanie "liczba_losowa.zarodek_losowania" - z ang. - :func:`random.seed` lub "narzędzia_wielokrotnego_wykonania.powtarzalnie_zepnij" - z ang. - :func:`itertools.izip` jasno określa, że sposoby wykonania tych zadań zostały umieszczone w zbiorach zadań i uogólnień "liczb losowych" i "narzędzi wielokrotnego wykonania", odpowiednio.

source: Old name for the flavor of classes now used for all class objects. In earlier Python versions, only new-style classes could use Python's newer, versatile features like :attr:`__slots__`, descriptors, properties, :meth:`__getattribute__`, class methods, and static methods.
pl: Starsza nazwa odmiany uogólnień, obecnie używanych dla wszystkich przedmiotów uogólnień. W poprzednich wydaniach język pytonowski pozwalał aby tylko uogólnienia korzystające z polecenia "nowy" ( - z ang. - new) używały nowszych, poręcznych własności takich, jak własność "gniazd" - z ang. - :attr:`__slots__`, opisy katalogowe, właściwości, sposób postępowania "weź_własność" - z ang. - :meth:`__getattribute__`, sposoby postępowania dla uogólnienia i współdzielone sposoby postępowania.

source: Any data with state (attributes or value) and defined behavior (methods). Also the ultimate base class of any :term:`new-style class`.
pl: Dowolne wiadomości znajdujące się w jakimś stanie(określonym przez własności lub wartość) i określone dodatkowo zachowanie (sposoby postępowania). Także uogólnienie leżące u ostatecznej podstawy każdego uogólnienia w rodzaju uwzględniającym tworzenie za pomocą polecenia "nowy" - z ang. - :term:`new-style class`.

source: The arguments assigned to local names inside a function or method, determined by the order in which they were given in the call. ``*`` is used to either accept multiple positional arguments (when in the definition), or pass several arguments as a list to a function. See :term:`argument`.
pl: Wytyczne przyporządkowane miejscowym nazwom we wnętrzu zadań lub sposobów zachowania, określone przez kolejność w jakiej zostały wpisane w odniesieniu do zadania. Znak gwiazdki - ``*`` - jest używany do przyjmowania wielu uporządkowanych względem kolejności wytycznych (kiedy znajdzie się w zapisie warunków w określeniu zadania), lub może też być używany do podania kilku wytycznych jako listy do zadania. Zobacz wyraz "wytyczna" - z ang. - :term:`argument`.

source: Nickname for the Python 3.x release line (coined long ago when the release of version 3 was something in the distant future.) This is also abbreviated "Py3k".
pl: Medialne określenie używane dla hasła wiodącego dla języka pytonowskiego w wydaniach powyżej trzeciego w głównej linii (określenie ukute dawno temu gdy wydanie trzecie było czymś z odległej przyszłości). To określenie jest skracane do "pytona 3 tysiące" - z ang. - "Py3k".

source: An idea or piece of code which closely follows the most common idioms of the Python language, rather than implementing code using concepts common to other languages. For example, a common idiom in Python is to loop over all elements of an iterable using a :keyword:`for` statement. Many other languages don't have this type of construct, so people unfamiliar with Python sometimes use a numerical counter instead::
pl: Pomysł bądź fragment programu, które w zbliżony sposób naśladuje najczęstsze wyrażenia szczególne dla języka pytonowskiego, zamiast wypełniania kodem stosując się do przyzwyczajeń znanych z innych języków. Na przykład, znanym szczególnym wyrażeniem w języku pytonowskim jest powtarzanie wykonania podprogramu dla wszystkich rzeczy pochodzących z kolekcji przy użyciu wyrażenia "dla..." - z ang. - :keyword:`for`. Wiele innych języków nie ma tego rodzaju wyrażeń, więc Ci którzy nie znają jeszcze dobrze języka pytonowskiego zamiennie używają czasami licznika liczbowego::

source: for i in range(len(food)): print(food[i])
pl: "dla i w zakresie(rozmiar(jedzenie)): napisz(jedzenie[i])" - z ang. - for i in range(len(food)): print(food[i])

source: As opposed to the cleaner, Pythonic method::
pl: W przeciwieństwie do bardziej czystego sposobu zapisu pytonowskiego::

source: for piece in food: print(piece)
pl: "dla kawałka wśród jedzenia: napisz(kawałek)" - z ang. - for piece in food: print(piece)

source: The number of references to an object. When the reference count of an object drops to zero, it is deallocated. Reference counting is generally not visible to Python code, but it is a key element of the :term:`CPython` implementation. The :mod:`sys` module defines a :func:`~sys.getrefcount` function that programmers can call to return the reference count for a particular object.
pl: Ilość odniesień do określonego przedmiotu. Kiedy ilości odniesień do przedmiotu spada do zera, jest on wymiatany. liczenie odniesień jest w zasadzie niewidoczne w programie pytonowskim, ale jest jedną z najistotniejszych spraw praktycznego wypełnienia założeń języka pytonowskiego - z ang. - ":term:`CPython` implementation". Zbiór zadań i uogólnień "osnowy" - z ang - :mod:`sys` określa zadanie "osnowa.podajilośćodniesień" - z ang. - :func:`~sys.getrefcount` które piszący programy mogą użyć aby otrzymać ilość odniesień do interesującego ich przedmiotu.

source: A declaration inside a class that saves memory by pre-declaring space for instance attributes and eliminating instance dictionaries. Though popular, the technique is somewhat tricky to get right and is best reserved for rare cases where there are large numbers of instances in a memory-critical application.
pl: Zaznaczenie we wnętrzu uogólnienia, którego wynikiem jest oszczędność miejsca składowania przez jego wcześniejsze zaplanowanie dla właściwości przykładowego przedmiotu i odrzucenie słowników przykładowych przedmiotów. Chociaż pozytywnie odebrana, ta możliwość może sprawiać nieco kłopotów przy próbach poprawnego z niej skorzystania i najlepiej zachować ją na szczególne okazje gdy jest dużo przedmiotów będących przykładami konkretnego uogólnienia w zastosowaniach, w których istotna jest jak najoszczędniejsze wykorzystanie przestrzeni na te przedmioty.

source: An :term:`iterable` which supports efficient element access using integer indices via the :meth:`__getitem__` special method and defines a :meth:`len` method that returns the length of the sequence. Some built-in sequence types are :class:`list`, :class:`str`, :class:`tuple`, and :class:`bytes`. Note that :class:`dict` also supports :meth:`__getitem__` and :meth:`__len__`, but is considered a mapping rather than a sequence because the lookups use arbitrary :term:`immutable` keys rather than integers.
pl: Kolekcja - z ang. - :term:`iterable`, która umożliwia szybkie podawanie przedmiotów w niej zawartych przy użyciu odniesień uzyskanych przez wskazywanie ich numerów na liście przy użyciu szczególnego sposobu postępowania określonego dla "pobranie przedmiotu z kolekcji" :meth:`__getitem__` i określania sposobu postępowania dla "podanie wielkości" (kolekcji) ( - z ang. - :meth:`len`), którego wynikiem jest wielkość kolekcji. Niektórymi podstawowymi dla języka uogólnieniami kolejek są: lista - z ang. - :class:`list`, napis - :class:`str`, przedmiot wielokrotny - :class:`tuple`, i strzępy wiadomości w surowym zapisie :class:`bytes`. Należy zwrócić uwagę, że chociaż słowniki - z ang. - :class:`dict` - także umożliwiają "pobranie i przedmiotu z kolekcji" - z ang. - :meth:`__getitem__` i "podanie wielkości kolekcji" - z ang. - :meth:`__len__`, to jednak słownik jest postrzegany bardziej jako zbiór skojarzeń a w mniejszym stopniu kolejka gdyż sposób podglądania zawartości słownika opiera się na odniesieniu do przedmiotu słownika zbudowanemu na podstawie odniesienia do przedmiotu ze zbioru haseł których rodzaj i uporządkowanie może być raczej dowolne i które są przedmiotami niepodlegającymi zmianom, a nie koniecznie muszą one być określone za pomocą uporządkowanego zbioru liczb całkowitych.

source: An object usually containing a portion of a :term:`sequence`. A slice is created using the subscript notation, ``[]`` with colons between numbers when several are given, such as in ``variable_name[1:3:5]``. The bracket (subscript) notation uses :class:`slice` objects internally.
pl: Przedmiot zwykle zawierający fragment kolejki - z ang. - :term:`sequence`. Wycinek jest tworzony przez wykonanie dodatkowego odniesienia zapisywanego w postaci przypisu dolnego, który uzyskuje się przez wpisanie po odniesieniu do kolejki przypisu dolnego jako wyrażenia w nawiasie prostokątnym - ``[]``, rozdzielając wewnątrz liczby dodatkowymi znakami dwukropków wstawianymi pomiędzy gdy jest liczb jest kilka, np. nazwa_kolejki[1:3:5]``. Zapis w nawiasie prostokątnym (rozumianym jako przypis dolny) powoduje skorzystanie z przedmiotów wpisujących się w uogólnienie "wycinka" - z ang. - :class:`slice` po przetłumaczeniu go na wewnętrzną szczegółową postać zapisów w języku pytonowskim.

source: A method that is called implicitly by Python to execute a certain operation on a type, such as addition. Such methods have names starting and ending with double underscores. Special methods are documented in :ref:`specialnames`.
pl: Sposób postępowania do którego język pytonowski odnosi się w domyśle aby wykonać pewne działania z przedmiotem określonego rodzaju, takie jak dodawanie. Nazwy takich sposobów postępowania zawsze zaczynają się i kończą dwoma znakami podkreślenia. Szczególne sposoby postępowania są opisane w rozdziale o "szczególnych nazwach" - z ang. - :ref:`specialnames`.

source: A statement is part of a suite (a "block" of code). A statement is either an :term:`expression` or a one of several constructs with a keyword, such as :keyword:`if`, :keyword:`while` or :keyword:`for`.
pl: Stwierdzenie jest częścią zestawu poleceń ("kawałka" programu). Stwierdzenie jest albo "wyrażeniem" - z ang. - :term:`expression`, albo jednym z wielu zestawień złożonych w których występuje słowa o szczególnym znaczeniu, takim jak np. "jeżeli" - z ang. - :keyword:`if`, "dopóki" - z ang. - :keyword:`while` lub "dla" - z ang. - :keyword:`for`.

source: A string which is bound by three instances of either a quotation mark (") or an apostrophe ('). While they don't provide any functionality not available with single-quoted strings, they are useful for a number of reasons. They allow you to include unescaped single and double quotes within a string and they can span multiple lines without the use of the continuation character, making them especially useful when writing docstrings.
pl: Napis, który jest związany przez trzy powtórzenia znaku cytowania (") lub znaku apostrofu ('). Chociaż nie spełniają one żadnego specjalnego zadania które nie byłoby dostępne w pojedynczo cytowanych zawartościach napisów, jednak są użyteczne z paru powodów. Pozwalają zawrzeć we wnętrzu napisu znaki pojedynczego bądź podwójnego cytowania bez stosowania znaku ucieczki (lewego ukośnika, czyli skośnika - \) i pozwalają umieścić napis w więcej niż jednej linii tekstu bez używania znaku "dalszego ciągu tekstu" (\), czyniąc je szczególnie użytecznymi podczas pisania objaśnień do programu czy zestawu zadań.

source: The type of a Python object determines what kind of object it is; every object has a type. An object's type is accessible as its :attr:`__class__` attribute or can be retrieved with ``type(obj)``.
pl: uogólnienie na którym opiera się dany przedmiot w języku pytonowskim ustala jakiego rodzaju jest to przedmiot. Każdy przedmiot ma swoje uogólnienie, którego jest jest przykładem. Uogólnienie, którego przykładem jest przedmiot, można otrzymać przez odniesienie do jego właściwości "uogólnienia" - z ang. - :attr:`__class__`, lub może być uzyskane jako wynik wykonania zadania "podania rodzaju" przedmiotu - z ang. - ``type(obj)``.

source: The objects returned from :meth:`dict.keys`, :meth:`dict.values`, and :meth:`dict.items` are called dictionary views. They are lazy sequences that will see changes in the underlying dictionary. To force the dictionary view to become a full list use ``list(dictview)``. See :ref:`dict-views`.
pl: Przedmioty będące wynikami wykonania sposobów postępowania "podania haseł" - z ang. - :meth:`dict.keys`, "podania przedmiotów odpowiadających hasłom" - z ang. - :meth:`dict.values` i "podania parami haseł z przedmiotami im przyporządkowanymi" - z ang. - :meth:`dict.items` zwane są widokami słownika. Są one kolekcjami (kolejkami) o przedmiotach których zawartość jest ustalana "z opóźnieniem", tzn. takimi które uwidocznią zmiany zachodzące w leżącym u ich podstaw słowniku, gdyż są tylko odniesieniami do zawartości słownika. Aby zastosować trwałą zamianę widoku słownika na pełnoprawną listę, należy użyć "lista(widoksłownika)" - z ang. - ``list(dictview)``. Zobacz też: widoki-słowników - z ang. - :ref:`dict-views`.

source: A computer defined entirely in software. Python's virtual machine executes the :term:`bytecode` emitted by the bytecode compiler.
pl: Urządzenie liczące określone całkowicie w postaci programu. Wynikające urządzenie języka pytonowskiego wykonuje polecenia o postaci surowej właściwe dla tego urządzenia - z ang. - :term:`bytecode` wytworzone przez tłumacza poleceń w postaci surowych wskazań.

source: Listing of Python design principles and philosophies that are helpful in understanding and using the language. The listing can be found by typing "``import this``" at the interactive prompt.
pl: Spis założeń projektowania języka pytonowskiego i sposobów patrzenia, które są pomocne w zrozumieniu i używaniu tego języka. Spis można znaleźć wpisując "pobierz to" - z ang. - "``import this``" w odpowiedzi na zapytanie współpracującego z piszącym programy tłumaczem języka.
